app/controllers/tasks_controller.rb

SELECT `tasks`.* FROM `tasks`
---
	def index
		@tasks = Task.all

INSERT INTO `tasks` (`content`, `comment`, `status`, `created_at`, `updated_at`) VALUES ('nhac', 'nhac moi', TRUE, '2018-06-08 07:27:39', '2018-06-08 07:27:39')
---
	def create
		@task = Task.new(task_params)
		if @task.save

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
---
	def edit
		@task = Task.find(params[:id])

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
---
	def show
		@task = Task.find(params[:id])

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
UPDATE `tasks` SET `content` = 'ruby', `updated_at` = '2018-06-08 07:27:11' WHERE `tasks`.`id` = 1
---
	def update
		@task = Task.find(params[:id])
	if @task.update(task_params)